grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** PIOB_IFSR_P31 Input Filter Status **/
#define PIOB_IFSR_P31		(1 << 31)
/** PIOB_IFSR_P30 Input Filter Status **/
#define PIOB_IFSR_P30		(1 << 30)
/** PIOB_IFSR_P29 Input Filter Status **/
#define PIOB_IFSR_P29		(1 << 29)
/** PIOB_IFSR_P28 Input Filter Status **/
#define PIOB_IFSR_P28		(1 << 28)
/** PIOB_IFSR_P27 Input Filter Status **/
#define PIOB_IFSR_P27		(1 << 27)
/** PIOB_IFSR_P26 Input Filter Status **/
#define PIOB_IFSR_P26		(1 << 26)
/** PIOB_IFSR_P25 Input Filter Status **/
#define PIOB_IFSR_P25		(1 << 25)
/** PIOB_IFSR_P24 Input Filter Status **/
#define PIOB_IFSR_P24		(1 << 24)
/** PIOB_IFSR_P23 Input Filter Status **/
#define PIOB_IFSR_P23		(1 << 23)
/** PIOB_IFSR_P22 Input Filter Status **/
#define PIOB_IFSR_P22		(1 << 22)
/** PIOB_IFSR_P21 Input Filter Status **/
#define PIOB_IFSR_P21		(1 << 21)
/** PIOB_IFSR_P20 Input Filter Status **/
#define PIOB_IFSR_P20		(1 << 20)
/** PIOB_IFSR_P19 Input Filter Status **/
#define PIOB_IFSR_P19		(1 << 19)
/** PIOB_IFSR_P18 Input Filter Status **/
#define PIOB_IFSR_P18		(1 << 18)
/** PIOB_IFSR_P17 Input Filter Status **/
#define PIOB_IFSR_P17		(1 << 17)
/** PIOB_IFSR_P16 Input Filter Status **/
#define PIOB_IFSR_P16		(1 << 16)
/** PIOB_IFSR_P15 Input Filter Status **/
#define PIOB_IFSR_P15		(1 << 15)
/** PIOB_IFSR_P14 Input Filter Status **/
#define PIOB_IFSR_P14		(1 << 14)
/** PIOB_IFSR_P13 Input Filter Status **/
#define PIOB_IFSR_P13		(1 << 13)
/** PIOB_IFSR_P12 Input Filter Status **/
#define PIOB_IFSR_P12		(1 << 12)
/** PIOB_IFSR_P11 Input Filter Status **/
#define PIOB_IFSR_P11		(1 << 11)
/** PIOB_IFSR_P10 Input Filter Status **/
#define PIOB_IFSR_P10		(1 << 10)
/** PIOB_IFSR_P9 Input Filter Status **/
#define PIOB_IFSR_P9		(1 << 9)
/** PIOB_IFSR_P8 Input Filter Status **/
#define PIOB_IFSR_P8		(1 << 8)
/** PIOB_IFSR_P7 Input Filter Status **/
#define PIOB_IFSR_P7		(1 << 7)
/** PIOB_IFSR_P6 Input Filter Status **/
#define PIOB_IFSR_P6		(1 << 6)
/** PIOB_IFSR_P5 Input Filter Status **/
#define PIOB_IFSR_P5		(1 << 5)
/** PIOB_IFSR_P4 Input Filter Status **/
#define PIOB_IFSR_P4		(1 << 4)
/** PIOB_IFSR_P3 Input Filter Status **/
#define PIOB_IFSR_P3		(1 << 3)
/** PIOB_IFSR_P2 Input Filter Status **/
#define PIOB_IFSR_P2		(1 << 2)
/** PIOB_IFSR_P1 Input Filter Status **/
#define PIOB_IFSR_P1		(1 << 1)
/** PIOB_IFSR_P0 Input Filter Status **/
#define PIOB_IFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_sodr SODR Set Output Data Register
@{*/

/** PIOB_SODR_P31 Set Output Data **/
#define PIOB_SODR_P31		(1 << 31)
/** PIOB_SODR_P30 Set Output Data **/
#define PIOB_SODR_P30		(1 << 30)
/** PIOB_SODR_P29 Set Output Data **/
#define PIOB_SODR_P29		(1 << 29)
/** PIOB_SODR_P28 Set Output Data **/
#define PIOB_SODR_P28		(1 << 28)
/** PIOB_SODR_P27 Set Output Data **/
#define PIOB_SODR_P27		(1 << 27)
/** PIOB_SODR_P26 Set Output Data **/
#define PIOB_SODR_P26		(1 << 26)
/** PIOB_SODR_P25 Set Output Data **/
#define PIOB_SODR_P25		(1 << 25)
/** PIOB_SODR_P24 Set Output Data **/
#define PIOB_SODR_P24		(1 << 24)
/** PIOB_SODR_P23 Set Output Data **/
#define PIOB_SODR_P23		(1 << 23)
/** PIOB_SODR_P22 Set Output Data **/
#define PIOB_SODR_P22		(1 << 22)
/** PIOB_SODR_P21 Set Output Data **/
#define PIOB_SODR_P21		(1 << 21)
/** PIOB_SODR_P20 Set Output Data **/
#define PIOB_SODR_P20		(1 << 20)
/** PIOB_SODR_P19 Set Output Data **/
#define PIOB_SODR_P19		(1 << 19)
/** PIOB_SODR_P18 Set Output Data **/
#define PIOB_SODR_P18		(1 << 18)
/** PIOB_SODR_P17 Set Output Data **/
#define PIOB_SODR_P17		(1 << 17)
/** PIOB_SODR_P16 Set Output Data **/
#define PIOB_SODR_P16		(1 << 16)
/** PIOB_SODR_P15 Set Output Data **/
#define PIOB_SODR_P15		(1 << 15)
/** PIOB_SODR_P14 Set Output Data **/
#define PIOB_SODR_P14		(1 << 14)
/** PIOB_SODR_P13 Set Output Data **/
#define PIOB_SODR_P13		(1 << 13)
/** PIOB_SODR_P12 Set Output Data **/
#define PIOB_SODR_P12		(1 << 12)
/** PIOB_SODR_P11 Set Output Data **/
#define PIOB_SODR_P11		(1 << 11)
/** PIOB_SODR_P10 Set Output Data **/
#define PIOB_SODR_P10		(1 << 10)
/** PIOB_SODR_P9 Set Output Data **/
#define PIOB_SODR_P9		(1 << 9)
/** PIOB_SODR_P8 Set Output Data **/
#define PIOB_SODR_P8		(1 << 8)
/** PIOB_SODR_P7 Set Output Data **/
#define PIOB_SODR_P7		(1 << 7)
/** PIOB_SODR_P6 Set Output Data **/
#define PIOB_SODR_P6		(1 << 6)
/** PIOB_SODR_P5 Set Output Data **/
#define PIOB_SODR_P5		(1 << 5)
/** PIOB_SODR_P4 Set Output Data **/
#define PIOB_SODR_P4		(1 << 4)
/** PIOB_SODR_P3 Set Output Data **/
#define PIOB_SODR_P3		(1 << 3)
/** PIOB_SODR_P2 Set Output Data **/
#define PIOB_SODR_P2		(1 << 2)
/** PIOB_SODR_P1 Set Output Data **/
#define PIOB_SODR_P1		(1 << 1)
/** PIOB_SODR_P0 Set Output Data **/
#define PIOB_SODR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_codr CODR Clear Output Data Register
@{*/

/** PIOB_CODR_P31 Clear Output Data **/
#define PIOB_CODR_P31		(1 << 31)
/** PIOB_CODR_P30 Clear Output Data **/
#define PIOB_CODR_P30		(1 << 30)
/** PIOB_CODR_P29 Clear Output Data **/
#define PIOB_CODR_P29		(1 << 29)
/** PIOB_CODR_P28 Clear Output Data **/
#define PIOB_CODR_P28		(1 << 28)
/** PIOB_CODR_P27 Clear Output Data **/
#define PIOB_CODR_P27		(1 << 27)
/** PIOB_CODR_P26 Clear Output Data **/
#define PIOB_CODR_P26		(1 << 26)
/** PIOB_CODR_P25 Clear Output Data **/
#define PIOB_CODR_P25		(1 << 25)
/** PIOB_CODR_P24 Clear Output Data **/
#define PIOB_CODR_P24		(1 << 24)
/** PIOB_CODR_P23 Clear Output Data **/
#define PIOB_CODR_P23		(1 << 23)
/** PIOB_CODR_P22 Clear Output Data **/
#define PIOB_CODR_P22		(1 << 22)
/** PIOB_CODR_P21 Clear Output Data **/
#define PIOB_CODR_P21		(1 << 21)
/** PIOB_CODR_P20 Clear Output Data **/
#define PIOB_CODR_P20		(1 << 20)
/** PIOB_CODR_P19 Clear Output Data **/
#define PIOB_CODR_P19		(1 << 19)
/** PIOB_CODR_P18 Clear Output Data **/
#define PIOB_CODR_P18		(1 << 18)
/** PIOB_CODR_P17 Clear Output Data **/
#define PIOB_CODR_P17		(1 << 17)
/** PIOB_CODR_P16 Clear Output Data **/
#define PIOB_CODR_P16		(1 << 16)
/** PIOB_CODR_P15 Clear Output Data **/
#define PIOB_CODR_P15		(1 << 15)
/** PIOB_CODR_P14 Clear Output Data **/
#define PIOB_CODR_P14		(1 << 14)
/** PIOB_CODR_P13 Clear Output Data **/
#define PIOB_CODR_P13		(1 << 13)
/** PIOB_CODR_P12 Clear Output Data **/
#define PIOB_CODR_P12		(1 << 12)
/** PIOB_CODR_P11 Clear Output Data **/
#define PIOB_CODR_P11		(1 << 11)
/** PIOB_CODR_P10 Clear Output Data **/
#define PIOB_CODR_P10		(1 << 10)
/** PIOB_CODR_P9 Clear Output Data **/
#define PIOB_CODR_P9		(1 << 9)
/** PIOB_CODR_P8 Clear Output Data **/
#define PIOB_CODR_P8		(1 << 8)
/** PIOB_CODR_P7 Clear Output Data **/
#define PIOB_CODR_P7		(1 << 7)
/** PIOB_CODR_P6 Clear Output Data **/
#define PIOB_CODR_P6		(1 << 6)
/** PIOB_CODR_P5 Clear Output Data **/
#define PIOB_CODR_P5		(1 << 5)
/** PIOB_CODR_P4 Clear Output Data **/
#define PIOB_CODR_P4		(1 << 4)
/** PIOB_CODR_P3 Clear Output Data **/
#define PIOB_CODR_P3		(1 << 3)
/** PIOB_CODR_P2 Clear Output Data **/
#define PIOB_CODR_P2		(1 << 2)
/** PIOB_CODR_P1 Clear Output Data **/
#define PIOB_CODR_P1		(1 << 1)
/** PIOB_CODR_P0 Clear Output Data **/
#define PIOB_CODR_P0		(1 << 0)

/**@}*/

