grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** @defgroup piob_abcdsr[1] ABCDSR[1] Peripheral Select Register
@{*/

/** PIOB_ABCDSR[1]_P31 Peripheral Select **/
#define PIOB_ABCDSR[1]_P31		(1 << 31)
/** PIOB_ABCDSR[1]_P30 Peripheral Select **/
#define PIOB_ABCDSR[1]_P30		(1 << 30)
/** PIOB_ABCDSR[1]_P29 Peripheral Select **/
#define PIOB_ABCDSR[1]_P29		(1 << 29)
/** PIOB_ABCDSR[1]_P28 Peripheral Select **/
#define PIOB_ABCDSR[1]_P28		(1 << 28)
/** PIOB_ABCDSR[1]_P27 Peripheral Select **/
#define PIOB_ABCDSR[1]_P27		(1 << 27)
/** PIOB_ABCDSR[1]_P26 Peripheral Select **/
#define PIOB_ABCDSR[1]_P26		(1 << 26)
/** PIOB_ABCDSR[1]_P25 Peripheral Select **/
#define PIOB_ABCDSR[1]_P25		(1 << 25)
/** PIOB_ABCDSR[1]_P24 Peripheral Select **/
#define PIOB_ABCDSR[1]_P24		(1 << 24)
/** PIOB_ABCDSR[1]_P23 Peripheral Select **/
#define PIOB_ABCDSR[1]_P23		(1 << 23)
/** PIOB_ABCDSR[1]_P22 Peripheral Select **/
#define PIOB_ABCDSR[1]_P22		(1 << 22)
/** PIOB_ABCDSR[1]_P21 Peripheral Select **/
#define PIOB_ABCDSR[1]_P21		(1 << 21)
/** PIOB_ABCDSR[1]_P20 Peripheral Select **/
#define PIOB_ABCDSR[1]_P20		(1 << 20)
/** PIOB_ABCDSR[1]_P19 Peripheral Select **/
#define PIOB_ABCDSR[1]_P19		(1 << 19)
/** PIOB_ABCDSR[1]_P18 Peripheral Select **/
#define PIOB_ABCDSR[1]_P18		(1 << 18)
/** PIOB_ABCDSR[1]_P17 Peripheral Select **/
#define PIOB_ABCDSR[1]_P17		(1 << 17)
/** PIOB_ABCDSR[1]_P16 Peripheral Select **/
#define PIOB_ABCDSR[1]_P16		(1 << 16)
/** PIOB_ABCDSR[1]_P15 Peripheral Select **/
#define PIOB_ABCDSR[1]_P15		(1 << 15)
/** PIOB_ABCDSR[1]_P14 Peripheral Select **/
#define PIOB_ABCDSR[1]_P14		(1 << 14)
/** PIOB_ABCDSR[1]_P13 Peripheral Select **/
#define PIOB_ABCDSR[1]_P13		(1 << 13)
/** PIOB_ABCDSR[1]_P12 Peripheral Select **/
#define PIOB_ABCDSR[1]_P12		(1 << 12)
/** PIOB_ABCDSR[1]_P11 Peripheral Select **/
#define PIOB_ABCDSR[1]_P11		(1 << 11)
/** PIOB_ABCDSR[1]_P10 Peripheral Select **/
#define PIOB_ABCDSR[1]_P10		(1 << 10)
/** PIOB_ABCDSR[1]_P9 Peripheral Select **/
#define PIOB_ABCDSR[1]_P9		(1 << 9)
/** PIOB_ABCDSR[1]_P8 Peripheral Select **/
#define PIOB_ABCDSR[1]_P8		(1 << 8)
/** PIOB_ABCDSR[1]_P7 Peripheral Select **/
#define PIOB_ABCDSR[1]_P7		(1 << 7)
/** PIOB_ABCDSR[1]_P6 Peripheral Select **/
#define PIOB_ABCDSR[1]_P6		(1 << 6)
/** PIOB_ABCDSR[1]_P5 Peripheral Select **/
#define PIOB_ABCDSR[1]_P5		(1 << 5)
/** PIOB_ABCDSR[1]_P4 Peripheral Select **/
#define PIOB_ABCDSR[1]_P4		(1 << 4)
/** PIOB_ABCDSR[1]_P3 Peripheral Select **/
#define PIOB_ABCDSR[1]_P3		(1 << 3)
/** PIOB_ABCDSR[1]_P2 Peripheral Select **/
#define PIOB_ABCDSR[1]_P2		(1 << 2)
/** PIOB_ABCDSR[1]_P1 Peripheral Select **/
#define PIOB_ABCDSR[1]_P1		(1 << 1)
/** PIOB_ABCDSR[1]_P0 Peripheral Select **/
#define PIOB_ABCDSR[1]_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscdr IFSCDR Input Filter Slow Clock Disable Register
@{*/

/** PIOB_IFSCDR_P31 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P31		(1 << 31)
/** PIOB_IFSCDR_P30 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P30		(1 << 30)
/** PIOB_IFSCDR_P29 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P29		(1 << 29)
/** PIOB_IFSCDR_P28 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P28		(1 << 28)
/** PIOB_IFSCDR_P27 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P27		(1 << 27)
/** PIOB_IFSCDR_P26 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P26		(1 << 26)
/** PIOB_IFSCDR_P25 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P25		(1 << 25)
/** PIOB_IFSCDR_P24 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P24		(1 << 24)
/** PIOB_IFSCDR_P23 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P23		(1 << 23)
/** PIOB_IFSCDR_P22 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P22		(1 << 22)
/** PIOB_IFSCDR_P21 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P21		(1 << 21)
/** PIOB_IFSCDR_P20 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P20		(1 << 20)
/** PIOB_IFSCDR_P19 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P19		(1 << 19)
/** PIOB_IFSCDR_P18 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P18		(1 << 18)
/** PIOB_IFSCDR_P17 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P17		(1 << 17)
/** PIOB_IFSCDR_P16 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P16		(1 << 16)
/** PIOB_IFSCDR_P15 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P15		(1 << 15)
/** PIOB_IFSCDR_P14 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P14		(1 << 14)
/** PIOB_IFSCDR_P13 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P13		(1 << 13)
/** PIOB_IFSCDR_P12 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P12		(1 << 12)
/** PIOB_IFSCDR_P11 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P11		(1 << 11)
/** PIOB_IFSCDR_P10 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P10		(1 << 10)
/** PIOB_IFSCDR_P9 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P9		(1 << 9)
/** PIOB_IFSCDR_P8 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P8		(1 << 8)
/** PIOB_IFSCDR_P7 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P7		(1 << 7)
/** PIOB_IFSCDR_P6 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P6		(1 << 6)
/** PIOB_IFSCDR_P5 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P5		(1 << 5)
/** PIOB_IFSCDR_P4 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P4		(1 << 4)
/** PIOB_IFSCDR_P3 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P3		(1 << 3)
/** PIOB_IFSCDR_P2 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P2		(1 << 2)
/** PIOB_IFSCDR_P1 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P1		(1 << 1)
/** PIOB_IFSCDR_P0 Peripheral Clock Glitch Filtering Select **/
#define PIOB_IFSCDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscer IFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOB_IFSCER_P31 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P31		(1 << 31)
/** PIOB_IFSCER_P30 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P30		(1 << 30)
/** PIOB_IFSCER_P29 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P29		(1 << 29)
/** PIOB_IFSCER_P28 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P28		(1 << 28)
/** PIOB_IFSCER_P27 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P27		(1 << 27)
/** PIOB_IFSCER_P26 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P26		(1 << 26)
/** PIOB_IFSCER_P25 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P25		(1 << 25)
/** PIOB_IFSCER_P24 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P24		(1 << 24)
/** PIOB_IFSCER_P23 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P23		(1 << 23)
/** PIOB_IFSCER_P22 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P22		(1 << 22)
/** PIOB_IFSCER_P21 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P21		(1 << 21)
/** PIOB_IFSCER_P20 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P20		(1 << 20)
/** PIOB_IFSCER_P19 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P19		(1 << 19)
/** PIOB_IFSCER_P18 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P18		(1 << 18)
/** PIOB_IFSCER_P17 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P17		(1 << 17)
/** PIOB_IFSCER_P16 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P16		(1 << 16)
/** PIOB_IFSCER_P15 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P15		(1 << 15)
/** PIOB_IFSCER_P14 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P14		(1 << 14)
/** PIOB_IFSCER_P13 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P13		(1 << 13)
/** PIOB_IFSCER_P12 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P12		(1 << 12)
/** PIOB_IFSCER_P11 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P11		(1 << 11)
/** PIOB_IFSCER_P10 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P10		(1 << 10)
/** PIOB_IFSCER_P9 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P9		(1 << 9)
/** PIOB_IFSCER_P8 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P8		(1 << 8)
/** PIOB_IFSCER_P7 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P7		(1 << 7)
/** PIOB_IFSCER_P6 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P6		(1 << 6)
/** PIOB_IFSCER_P5 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P5		(1 << 5)
/** PIOB_IFSCER_P4 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P4		(1 << 4)
/** PIOB_IFSCER_P3 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P3		(1 << 3)
/** PIOB_IFSCER_P2 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P2		(1 << 2)
/** PIOB_IFSCER_P1 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P1		(1 << 1)
/** PIOB_IFSCER_P0 Slow Clock Debouncing Filtering Select **/
#define PIOB_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscsr IFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOB_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P31		(1 << 31)
/** PIOB_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P30		(1 << 30)
/** PIOB_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P29		(1 << 29)
/** PIOB_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P28		(1 << 28)
/** PIOB_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P27		(1 << 27)
/** PIOB_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P26		(1 << 26)
/** PIOB_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P25		(1 << 25)
/** PIOB_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P24		(1 << 24)
/** PIOB_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P23		(1 << 23)
/** PIOB_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P22		(1 << 22)
/** PIOB_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P21		(1 << 21)
/** PIOB_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P20		(1 << 20)
/** PIOB_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P19		(1 << 19)
/** PIOB_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P18		(1 << 18)
/** PIOB_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P17		(1 << 17)
/** PIOB_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P16		(1 << 16)
/** PIOB_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P15		(1 << 15)
/** PIOB_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P14		(1 << 14)
/** PIOB_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P13		(1 << 13)
/** PIOB_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P12		(1 << 12)
/** PIOB_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P11		(1 << 11)
/** PIOB_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P10		(1 << 10)
/** PIOB_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P9		(1 << 9)
/** PIOB_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P8		(1 << 8)
/** PIOB_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P7		(1 << 7)
/** PIOB_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P6		(1 << 6)
/** PIOB_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P5		(1 << 5)
/** PIOB_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P4		(1 << 4)
/** PIOB_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P3		(1 << 3)
/** PIOB_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P2		(1 << 2)
/** PIOB_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P1		(1 << 1)
/** PIOB_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOB_SCDR_DIV_SHIFT		0
#define PIOB_SCDR_DIV_MASK		0x3fff
/** @defgroup piob_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup piob_ppddr PPDDR Pad Pull-down Disable Register
@{*/

/** PIOB_PPDDR_P31 Pull-Down Disable **/
#define PIOB_PPDDR_P31		(1 << 31)
/** PIOB_PPDDR_P30 Pull-Down Disable **/
#define PIOB_PPDDR_P30		(1 << 30)
/** PIOB_PPDDR_P29 Pull-Down Disable **/
#define PIOB_PPDDR_P29		(1 << 29)
/** PIOB_PPDDR_P28 Pull-Down Disable **/
#define PIOB_PPDDR_P28		(1 << 28)
/** PIOB_PPDDR_P27 Pull-Down Disable **/
#define PIOB_PPDDR_P27		(1 << 27)
/** PIOB_PPDDR_P26 Pull-Down Disable **/
#define PIOB_PPDDR_P26		(1 << 26)
/** PIOB_PPDDR_P25 Pull-Down Disable **/
#define PIOB_PPDDR_P25		(1 << 25)
/** PIOB_PPDDR_P24 Pull-Down Disable **/
#define PIOB_PPDDR_P24		(1 << 24)
/** PIOB_PPDDR_P23 Pull-Down Disable **/
#define PIOB_PPDDR_P23		(1 << 23)
/** PIOB_PPDDR_P22 Pull-Down Disable **/
#define PIOB_PPDDR_P22		(1 << 22)
/** PIOB_PPDDR_P21 Pull-Down Disable **/
#define PIOB_PPDDR_P21		(1 << 21)
/** PIOB_PPDDR_P20 Pull-Down Disable **/
#define PIOB_PPDDR_P20		(1 << 20)
/** PIOB_PPDDR_P19 Pull-Down Disable **/
#define PIOB_PPDDR_P19		(1 << 19)
/** PIOB_PPDDR_P18 Pull-Down Disable **/
#define PIOB_PPDDR_P18		(1 << 18)
/** PIOB_PPDDR_P17 Pull-Down Disable **/
#define PIOB_PPDDR_P17		(1 << 17)
/** PIOB_PPDDR_P16 Pull-Down Disable **/
#define PIOB_PPDDR_P16		(1 << 16)
/** PIOB_PPDDR_P15 Pull-Down Disable **/
#define PIOB_PPDDR_P15		(1 << 15)
/** PIOB_PPDDR_P14 Pull-Down Disable **/
#define PIOB_PPDDR_P14		(1 << 14)
/** PIOB_PPDDR_P13 Pull-Down Disable **/
#define PIOB_PPDDR_P13		(1 << 13)
/** PIOB_PPDDR_P12 Pull-Down Disable **/
#define PIOB_PPDDR_P12		(1 << 12)
/** PIOB_PPDDR_P11 Pull-Down Disable **/
#define PIOB_PPDDR_P11		(1 << 11)
/** PIOB_PPDDR_P10 Pull-Down Disable **/
#define PIOB_PPDDR_P10		(1 << 10)
/** PIOB_PPDDR_P9 Pull-Down Disable **/
#define PIOB_PPDDR_P9		(1 << 9)
/** PIOB_PPDDR_P8 Pull-Down Disable **/
#define PIOB_PPDDR_P8		(1 << 8)
/** PIOB_PPDDR_P7 Pull-Down Disable **/
#define PIOB_PPDDR_P7		(1 << 7)
/** PIOB_PPDDR_P6 Pull-Down Disable **/
#define PIOB_PPDDR_P6		(1 << 6)
/** PIOB_PPDDR_P5 Pull-Down Disable **/
#define PIOB_PPDDR_P5		(1 << 5)
/** PIOB_PPDDR_P4 Pull-Down Disable **/
#define PIOB_PPDDR_P4		(1 << 4)
/** PIOB_PPDDR_P3 Pull-Down Disable **/
#define PIOB_PPDDR_P3		(1 << 3)
/** PIOB_PPDDR_P2 Pull-Down Disable **/
#define PIOB_PPDDR_P2		(1 << 2)
/** PIOB_PPDDR_P1 Pull-Down Disable **/
#define PIOB_PPDDR_P1		(1 << 1)
/** PIOB_PPDDR_P0 Pull-Down Disable **/
#define PIOB_PPDDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ppder PPDER Pad Pull-down Enable Register
@{*/

/** PIOB_PPDER_P31 Pull-Down Enable **/
#define PIOB_PPDER_P31		(1 << 31)
/** PIOB_PPDER_P30 Pull-Down Enable **/
#define PIOB_PPDER_P30		(1 << 30)
/** PIOB_PPDER_P29 Pull-Down Enable **/
#define PIOB_PPDER_P29		(1 << 29)
/** PIOB_PPDER_P28 Pull-Down Enable **/
#define PIOB_PPDER_P28		(1 << 28)
/** PIOB_PPDER_P27 Pull-Down Enable **/
#define PIOB_PPDER_P27		(1 << 27)
/** PIOB_PPDER_P26 Pull-Down Enable **/
#define PIOB_PPDER_P26		(1 << 26)
/** PIOB_PPDER_P25 Pull-Down Enable **/
#define PIOB_PPDER_P25		(1 << 25)
/** PIOB_PPDER_P24 Pull-Down Enable **/
#define PIOB_PPDER_P24		(1 << 24)
/** PIOB_PPDER_P23 Pull-Down Enable **/
#define PIOB_PPDER_P23		(1 << 23)
/** PIOB_PPDER_P22 Pull-Down Enable **/
#define PIOB_PPDER_P22		(1 << 22)
/** PIOB_PPDER_P21 Pull-Down Enable **/
#define PIOB_PPDER_P21		(1 << 21)
/** PIOB_PPDER_P20 Pull-Down Enable **/
#define PIOB_PPDER_P20		(1 << 20)
/** PIOB_PPDER_P19 Pull-Down Enable **/
#define PIOB_PPDER_P19		(1 << 19)
/** PIOB_PPDER_P18 Pull-Down Enable **/
#define PIOB_PPDER_P18		(1 << 18)
/** PIOB_PPDER_P17 Pull-Down Enable **/
#define PIOB_PPDER_P17		(1 << 17)
/** PIOB_PPDER_P16 Pull-Down Enable **/
#define PIOB_PPDER_P16		(1 << 16)
/** PIOB_PPDER_P15 Pull-Down Enable **/
#define PIOB_PPDER_P15		(1 << 15)
/** PIOB_PPDER_P14 Pull-Down Enable **/
#define PIOB_PPDER_P14		(1 << 14)
/** PIOB_PPDER_P13 Pull-Down Enable **/
#define PIOB_PPDER_P13		(1 << 13)
/** PIOB_PPDER_P12 Pull-Down Enable **/
#define PIOB_PPDER_P12		(1 << 12)
/** PIOB_PPDER_P11 Pull-Down Enable **/
#define PIOB_PPDER_P11		(1 << 11)
/** PIOB_PPDER_P10 Pull-Down Enable **/
#define PIOB_PPDER_P10		(1 << 10)
/** PIOB_PPDER_P9 Pull-Down Enable **/
#define PIOB_PPDER_P9		(1 << 9)
/** PIOB_PPDER_P8 Pull-Down Enable **/
#define PIOB_PPDER_P8		(1 << 8)
/** PIOB_PPDER_P7 Pull-Down Enable **/
#define PIOB_PPDER_P7		(1 << 7)
/** PIOB_PPDER_P6 Pull-Down Enable **/
#define PIOB_PPDER_P6		(1 << 6)
/** PIOB_PPDER_P5 Pull-Down Enable **/
#define PIOB_PPDER_P5		(1 << 5)
/** PIOB_PPDER_P4 Pull-Down Enable **/
#define PIOB_PPDER_P4		(1 << 4)
/** PIOB_PPDER_P3 Pull-Down Enable **/
#define PIOB_PPDER_P3		(1 << 3)
/** PIOB_PPDER_P2 Pull-Down Enable **/
#define PIOB_PPDER_P2		(1 << 2)
/** PIOB_PPDER_P1 Pull-Down Enable **/
#define PIOB_PPDER_P1		(1 << 1)
/** PIOB_PPDER_P0 Pull-Down Enable **/
#define PIOB_PPDER_P0		(1 << 0)

/**@}*/

