grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** @defgroup piob_ppdsr PPDSR Pad Pull-down Status Register
@{*/

/** PIOB_PPDSR_P31 Pull-Down Status **/
#define PIOB_PPDSR_P31		(1 << 31)
/** PIOB_PPDSR_P30 Pull-Down Status **/
#define PIOB_PPDSR_P30		(1 << 30)
/** PIOB_PPDSR_P29 Pull-Down Status **/
#define PIOB_PPDSR_P29		(1 << 29)
/** PIOB_PPDSR_P28 Pull-Down Status **/
#define PIOB_PPDSR_P28		(1 << 28)
/** PIOB_PPDSR_P27 Pull-Down Status **/
#define PIOB_PPDSR_P27		(1 << 27)
/** PIOB_PPDSR_P26 Pull-Down Status **/
#define PIOB_PPDSR_P26		(1 << 26)
/** PIOB_PPDSR_P25 Pull-Down Status **/
#define PIOB_PPDSR_P25		(1 << 25)
/** PIOB_PPDSR_P24 Pull-Down Status **/
#define PIOB_PPDSR_P24		(1 << 24)
/** PIOB_PPDSR_P23 Pull-Down Status **/
#define PIOB_PPDSR_P23		(1 << 23)
/** PIOB_PPDSR_P22 Pull-Down Status **/
#define PIOB_PPDSR_P22		(1 << 22)
/** PIOB_PPDSR_P21 Pull-Down Status **/
#define PIOB_PPDSR_P21		(1 << 21)
/** PIOB_PPDSR_P20 Pull-Down Status **/
#define PIOB_PPDSR_P20		(1 << 20)
/** PIOB_PPDSR_P19 Pull-Down Status **/
#define PIOB_PPDSR_P19		(1 << 19)
/** PIOB_PPDSR_P18 Pull-Down Status **/
#define PIOB_PPDSR_P18		(1 << 18)
/** PIOB_PPDSR_P17 Pull-Down Status **/
#define PIOB_PPDSR_P17		(1 << 17)
/** PIOB_PPDSR_P16 Pull-Down Status **/
#define PIOB_PPDSR_P16		(1 << 16)
/** PIOB_PPDSR_P15 Pull-Down Status **/
#define PIOB_PPDSR_P15		(1 << 15)
/** PIOB_PPDSR_P14 Pull-Down Status **/
#define PIOB_PPDSR_P14		(1 << 14)
/** PIOB_PPDSR_P13 Pull-Down Status **/
#define PIOB_PPDSR_P13		(1 << 13)
/** PIOB_PPDSR_P12 Pull-Down Status **/
#define PIOB_PPDSR_P12		(1 << 12)
/** PIOB_PPDSR_P11 Pull-Down Status **/
#define PIOB_PPDSR_P11		(1 << 11)
/** PIOB_PPDSR_P10 Pull-Down Status **/
#define PIOB_PPDSR_P10		(1 << 10)
/** PIOB_PPDSR_P9 Pull-Down Status **/
#define PIOB_PPDSR_P9		(1 << 9)
/** PIOB_PPDSR_P8 Pull-Down Status **/
#define PIOB_PPDSR_P8		(1 << 8)
/** PIOB_PPDSR_P7 Pull-Down Status **/
#define PIOB_PPDSR_P7		(1 << 7)
/** PIOB_PPDSR_P6 Pull-Down Status **/
#define PIOB_PPDSR_P6		(1 << 6)
/** PIOB_PPDSR_P5 Pull-Down Status **/
#define PIOB_PPDSR_P5		(1 << 5)
/** PIOB_PPDSR_P4 Pull-Down Status **/
#define PIOB_PPDSR_P4		(1 << 4)
/** PIOB_PPDSR_P3 Pull-Down Status **/
#define PIOB_PPDSR_P3		(1 << 3)
/** PIOB_PPDSR_P2 Pull-Down Status **/
#define PIOB_PPDSR_P2		(1 << 2)
/** PIOB_PPDSR_P1 Pull-Down Status **/
#define PIOB_PPDSR_P1		(1 << 1)
/** PIOB_PPDSR_P0 Pull-Down Status **/
#define PIOB_PPDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ower OWER Output Write Enable
@{*/

/** PIOB_OWER_P31 Output Write Enable **/
#define PIOB_OWER_P31		(1 << 31)
/** PIOB_OWER_P30 Output Write Enable **/
#define PIOB_OWER_P30		(1 << 30)
/** PIOB_OWER_P29 Output Write Enable **/
#define PIOB_OWER_P29		(1 << 29)
/** PIOB_OWER_P28 Output Write Enable **/
#define PIOB_OWER_P28		(1 << 28)
/** PIOB_OWER_P27 Output Write Enable **/
#define PIOB_OWER_P27		(1 << 27)
/** PIOB_OWER_P26 Output Write Enable **/
#define PIOB_OWER_P26		(1 << 26)
/** PIOB_OWER_P25 Output Write Enable **/
#define PIOB_OWER_P25		(1 << 25)
/** PIOB_OWER_P24 Output Write Enable **/
#define PIOB_OWER_P24		(1 << 24)
/** PIOB_OWER_P23 Output Write Enable **/
#define PIOB_OWER_P23		(1 << 23)
/** PIOB_OWER_P22 Output Write Enable **/
#define PIOB_OWER_P22		(1 << 22)
/** PIOB_OWER_P21 Output Write Enable **/
#define PIOB_OWER_P21		(1 << 21)
/** PIOB_OWER_P20 Output Write Enable **/
#define PIOB_OWER_P20		(1 << 20)
/** PIOB_OWER_P19 Output Write Enable **/
#define PIOB_OWER_P19		(1 << 19)
/** PIOB_OWER_P18 Output Write Enable **/
#define PIOB_OWER_P18		(1 << 18)
/** PIOB_OWER_P17 Output Write Enable **/
#define PIOB_OWER_P17		(1 << 17)
/** PIOB_OWER_P16 Output Write Enable **/
#define PIOB_OWER_P16		(1 << 16)
/** PIOB_OWER_P15 Output Write Enable **/
#define PIOB_OWER_P15		(1 << 15)
/** PIOB_OWER_P14 Output Write Enable **/
#define PIOB_OWER_P14		(1 << 14)
/** PIOB_OWER_P13 Output Write Enable **/
#define PIOB_OWER_P13		(1 << 13)
/** PIOB_OWER_P12 Output Write Enable **/
#define PIOB_OWER_P12		(1 << 12)
/** PIOB_OWER_P11 Output Write Enable **/
#define PIOB_OWER_P11		(1 << 11)
/** PIOB_OWER_P10 Output Write Enable **/
#define PIOB_OWER_P10		(1 << 10)
/** PIOB_OWER_P9 Output Write Enable **/
#define PIOB_OWER_P9		(1 << 9)
/** PIOB_OWER_P8 Output Write Enable **/
#define PIOB_OWER_P8		(1 << 8)
/** PIOB_OWER_P7 Output Write Enable **/
#define PIOB_OWER_P7		(1 << 7)
/** PIOB_OWER_P6 Output Write Enable **/
#define PIOB_OWER_P6		(1 << 6)
/** PIOB_OWER_P5 Output Write Enable **/
#define PIOB_OWER_P5		(1 << 5)
/** PIOB_OWER_P4 Output Write Enable **/
#define PIOB_OWER_P4		(1 << 4)
/** PIOB_OWER_P3 Output Write Enable **/
#define PIOB_OWER_P3		(1 << 3)
/** PIOB_OWER_P2 Output Write Enable **/
#define PIOB_OWER_P2		(1 << 2)
/** PIOB_OWER_P1 Output Write Enable **/
#define PIOB_OWER_P1		(1 << 1)
/** PIOB_OWER_P0 Output Write Enable **/
#define PIOB_OWER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_owdr OWDR Output Write Disable
@{*/

/** PIOB_OWDR_P31 Output Write Disable **/
#define PIOB_OWDR_P31		(1 << 31)
/** PIOB_OWDR_P30 Output Write Disable **/
#define PIOB_OWDR_P30		(1 << 30)
/** PIOB_OWDR_P29 Output Write Disable **/
#define PIOB_OWDR_P29		(1 << 29)
/** PIOB_OWDR_P28 Output Write Disable **/
#define PIOB_OWDR_P28		(1 << 28)
/** PIOB_OWDR_P27 Output Write Disable **/
#define PIOB_OWDR_P27		(1 << 27)
/** PIOB_OWDR_P26 Output Write Disable **/
#define PIOB_OWDR_P26		(1 << 26)
/** PIOB_OWDR_P25 Output Write Disable **/
#define PIOB_OWDR_P25		(1 << 25)
/** PIOB_OWDR_P24 Output Write Disable **/
#define PIOB_OWDR_P24		(1 << 24)
/** PIOB_OWDR_P23 Output Write Disable **/
#define PIOB_OWDR_P23		(1 << 23)
/** PIOB_OWDR_P22 Output Write Disable **/
#define PIOB_OWDR_P22		(1 << 22)
/** PIOB_OWDR_P21 Output Write Disable **/
#define PIOB_OWDR_P21		(1 << 21)
/** PIOB_OWDR_P20 Output Write Disable **/
#define PIOB_OWDR_P20		(1 << 20)
/** PIOB_OWDR_P19 Output Write Disable **/
#define PIOB_OWDR_P19		(1 << 19)
/** PIOB_OWDR_P18 Output Write Disable **/
#define PIOB_OWDR_P18		(1 << 18)
/** PIOB_OWDR_P17 Output Write Disable **/
#define PIOB_OWDR_P17		(1 << 17)
/** PIOB_OWDR_P16 Output Write Disable **/
#define PIOB_OWDR_P16		(1 << 16)
/** PIOB_OWDR_P15 Output Write Disable **/
#define PIOB_OWDR_P15		(1 << 15)
/** PIOB_OWDR_P14 Output Write Disable **/
#define PIOB_OWDR_P14		(1 << 14)
/** PIOB_OWDR_P13 Output Write Disable **/
#define PIOB_OWDR_P13		(1 << 13)
/** PIOB_OWDR_P12 Output Write Disable **/
#define PIOB_OWDR_P12		(1 << 12)
/** PIOB_OWDR_P11 Output Write Disable **/
#define PIOB_OWDR_P11		(1 << 11)
/** PIOB_OWDR_P10 Output Write Disable **/
#define PIOB_OWDR_P10		(1 << 10)
/** PIOB_OWDR_P9 Output Write Disable **/
#define PIOB_OWDR_P9		(1 << 9)
/** PIOB_OWDR_P8 Output Write Disable **/
#define PIOB_OWDR_P8		(1 << 8)
/** PIOB_OWDR_P7 Output Write Disable **/
#define PIOB_OWDR_P7		(1 << 7)
/** PIOB_OWDR_P6 Output Write Disable **/
#define PIOB_OWDR_P6		(1 << 6)
/** PIOB_OWDR_P5 Output Write Disable **/
#define PIOB_OWDR_P5		(1 << 5)
/** PIOB_OWDR_P4 Output Write Disable **/
#define PIOB_OWDR_P4		(1 << 4)
/** PIOB_OWDR_P3 Output Write Disable **/
#define PIOB_OWDR_P3		(1 << 3)
/** PIOB_OWDR_P2 Output Write Disable **/
#define PIOB_OWDR_P2		(1 << 2)
/** PIOB_OWDR_P1 Output Write Disable **/
#define PIOB_OWDR_P1		(1 << 1)
/** PIOB_OWDR_P0 Output Write Disable **/
#define PIOB_OWDR_P0		(1 << 0)

/**@}*/

