grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** @defgroup piob_owsr OWSR Output Write Status Register
@{*/

/** PIOB_OWSR_P31 Output Write Status **/
#define PIOB_OWSR_P31		(1 << 31)
/** PIOB_OWSR_P30 Output Write Status **/
#define PIOB_OWSR_P30		(1 << 30)
/** PIOB_OWSR_P29 Output Write Status **/
#define PIOB_OWSR_P29		(1 << 29)
/** PIOB_OWSR_P28 Output Write Status **/
#define PIOB_OWSR_P28		(1 << 28)
/** PIOB_OWSR_P27 Output Write Status **/
#define PIOB_OWSR_P27		(1 << 27)
/** PIOB_OWSR_P26 Output Write Status **/
#define PIOB_OWSR_P26		(1 << 26)
/** PIOB_OWSR_P25 Output Write Status **/
#define PIOB_OWSR_P25		(1 << 25)
/** PIOB_OWSR_P24 Output Write Status **/
#define PIOB_OWSR_P24		(1 << 24)
/** PIOB_OWSR_P23 Output Write Status **/
#define PIOB_OWSR_P23		(1 << 23)
/** PIOB_OWSR_P22 Output Write Status **/
#define PIOB_OWSR_P22		(1 << 22)
/** PIOB_OWSR_P21 Output Write Status **/
#define PIOB_OWSR_P21		(1 << 21)
/** PIOB_OWSR_P20 Output Write Status **/
#define PIOB_OWSR_P20		(1 << 20)
/** PIOB_OWSR_P19 Output Write Status **/
#define PIOB_OWSR_P19		(1 << 19)
/** PIOB_OWSR_P18 Output Write Status **/
#define PIOB_OWSR_P18		(1 << 18)
/** PIOB_OWSR_P17 Output Write Status **/
#define PIOB_OWSR_P17		(1 << 17)
/** PIOB_OWSR_P16 Output Write Status **/
#define PIOB_OWSR_P16		(1 << 16)
/** PIOB_OWSR_P15 Output Write Status **/
#define PIOB_OWSR_P15		(1 << 15)
/** PIOB_OWSR_P14 Output Write Status **/
#define PIOB_OWSR_P14		(1 << 14)
/** PIOB_OWSR_P13 Output Write Status **/
#define PIOB_OWSR_P13		(1 << 13)
/** PIOB_OWSR_P12 Output Write Status **/
#define PIOB_OWSR_P12		(1 << 12)
/** PIOB_OWSR_P11 Output Write Status **/
#define PIOB_OWSR_P11		(1 << 11)
/** PIOB_OWSR_P10 Output Write Status **/
#define PIOB_OWSR_P10		(1 << 10)
/** PIOB_OWSR_P9 Output Write Status **/
#define PIOB_OWSR_P9		(1 << 9)
/** PIOB_OWSR_P8 Output Write Status **/
#define PIOB_OWSR_P8		(1 << 8)
/** PIOB_OWSR_P7 Output Write Status **/
#define PIOB_OWSR_P7		(1 << 7)
/** PIOB_OWSR_P6 Output Write Status **/
#define PIOB_OWSR_P6		(1 << 6)
/** PIOB_OWSR_P5 Output Write Status **/
#define PIOB_OWSR_P5		(1 << 5)
/** PIOB_OWSR_P4 Output Write Status **/
#define PIOB_OWSR_P4		(1 << 4)
/** PIOB_OWSR_P3 Output Write Status **/
#define PIOB_OWSR_P3		(1 << 3)
/** PIOB_OWSR_P2 Output Write Status **/
#define PIOB_OWSR_P2		(1 << 2)
/** PIOB_OWSR_P1 Output Write Status **/
#define PIOB_OWSR_P1		(1 << 1)
/** PIOB_OWSR_P0 Output Write Status **/
#define PIOB_OWSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_aimer AIMER Additional Interrupt Modes Enable Register
@{*/

/** PIOB_AIMER_P31 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P31		(1 << 31)
/** PIOB_AIMER_P30 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P30		(1 << 30)
/** PIOB_AIMER_P29 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P29		(1 << 29)
/** PIOB_AIMER_P28 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P28		(1 << 28)
/** PIOB_AIMER_P27 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P27		(1 << 27)
/** PIOB_AIMER_P26 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P26		(1 << 26)
/** PIOB_AIMER_P25 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P25		(1 << 25)
/** PIOB_AIMER_P24 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P24		(1 << 24)
/** PIOB_AIMER_P23 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P23		(1 << 23)
/** PIOB_AIMER_P22 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P22		(1 << 22)
/** PIOB_AIMER_P21 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P21		(1 << 21)
/** PIOB_AIMER_P20 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P20		(1 << 20)
/** PIOB_AIMER_P19 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P19		(1 << 19)
/** PIOB_AIMER_P18 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P18		(1 << 18)
/** PIOB_AIMER_P17 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P17		(1 << 17)
/** PIOB_AIMER_P16 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P16		(1 << 16)
/** PIOB_AIMER_P15 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P15		(1 << 15)
/** PIOB_AIMER_P14 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P14		(1 << 14)
/** PIOB_AIMER_P13 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P13		(1 << 13)
/** PIOB_AIMER_P12 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P12		(1 << 12)
/** PIOB_AIMER_P11 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P11		(1 << 11)
/** PIOB_AIMER_P10 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P10		(1 << 10)
/** PIOB_AIMER_P9 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P9		(1 << 9)
/** PIOB_AIMER_P8 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P8		(1 << 8)
/** PIOB_AIMER_P7 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P7		(1 << 7)
/** PIOB_AIMER_P6 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P6		(1 << 6)
/** PIOB_AIMER_P5 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P5		(1 << 5)
/** PIOB_AIMER_P4 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P4		(1 << 4)
/** PIOB_AIMER_P3 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P3		(1 << 3)
/** PIOB_AIMER_P2 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P2		(1 << 2)
/** PIOB_AIMER_P1 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P1		(1 << 1)
/** PIOB_AIMER_P0 Additional Interrupt Modes Enable **/
#define PIOB_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_aimdr AIMDR Additional Interrupt Modes Disable Register
@{*/

/** PIOB_AIMDR_P31 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P31		(1 << 31)
/** PIOB_AIMDR_P30 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P30		(1 << 30)
/** PIOB_AIMDR_P29 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P29		(1 << 29)
/** PIOB_AIMDR_P28 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P28		(1 << 28)
/** PIOB_AIMDR_P27 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P27		(1 << 27)
/** PIOB_AIMDR_P26 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P26		(1 << 26)
/** PIOB_AIMDR_P25 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P25		(1 << 25)
/** PIOB_AIMDR_P24 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P24		(1 << 24)
/** PIOB_AIMDR_P23 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P23		(1 << 23)
/** PIOB_AIMDR_P22 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P22		(1 << 22)
/** PIOB_AIMDR_P21 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P21		(1 << 21)
/** PIOB_AIMDR_P20 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P20		(1 << 20)
/** PIOB_AIMDR_P19 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P19		(1 << 19)
/** PIOB_AIMDR_P18 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P18		(1 << 18)
/** PIOB_AIMDR_P17 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P17		(1 << 17)
/** PIOB_AIMDR_P16 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P16		(1 << 16)
/** PIOB_AIMDR_P15 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P15		(1 << 15)
/** PIOB_AIMDR_P14 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P14		(1 << 14)
/** PIOB_AIMDR_P13 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P13		(1 << 13)
/** PIOB_AIMDR_P12 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P12		(1 << 12)
/** PIOB_AIMDR_P11 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P11		(1 << 11)
/** PIOB_AIMDR_P10 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P10		(1 << 10)
/** PIOB_AIMDR_P9 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P9		(1 << 9)
/** PIOB_AIMDR_P8 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P8		(1 << 8)
/** PIOB_AIMDR_P7 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P7		(1 << 7)
/** PIOB_AIMDR_P6 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P6		(1 << 6)
/** PIOB_AIMDR_P5 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P5		(1 << 5)
/** PIOB_AIMDR_P4 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P4		(1 << 4)
/** PIOB_AIMDR_P3 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P3		(1 << 3)
/** PIOB_AIMDR_P2 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P2		(1 << 2)
/** PIOB_AIMDR_P1 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P1		(1 << 1)
/** PIOB_AIMDR_P0 Additional Interrupt Modes Disable **/
#define PIOB_AIMDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_aimmr AIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOB_AIMMR_P31 IO Line Index **/
#define PIOB_AIMMR_P31		(1 << 31)
/** PIOB_AIMMR_P30 IO Line Index **/
#define PIOB_AIMMR_P30		(1 << 30)
/** PIOB_AIMMR_P29 IO Line Index **/
#define PIOB_AIMMR_P29		(1 << 29)
/** PIOB_AIMMR_P28 IO Line Index **/
#define PIOB_AIMMR_P28		(1 << 28)
/** PIOB_AIMMR_P27 IO Line Index **/
#define PIOB_AIMMR_P27		(1 << 27)
/** PIOB_AIMMR_P26 IO Line Index **/
#define PIOB_AIMMR_P26		(1 << 26)
/** PIOB_AIMMR_P25 IO Line Index **/
#define PIOB_AIMMR_P25		(1 << 25)
/** PIOB_AIMMR_P24 IO Line Index **/
#define PIOB_AIMMR_P24		(1 << 24)
/** PIOB_AIMMR_P23 IO Line Index **/
#define PIOB_AIMMR_P23		(1 << 23)
/** PIOB_AIMMR_P22 IO Line Index **/
#define PIOB_AIMMR_P22		(1 << 22)
/** PIOB_AIMMR_P21 IO Line Index **/
#define PIOB_AIMMR_P21		(1 << 21)
/** PIOB_AIMMR_P20 IO Line Index **/
#define PIOB_AIMMR_P20		(1 << 20)
/** PIOB_AIMMR_P19 IO Line Index **/
#define PIOB_AIMMR_P19		(1 << 19)
/** PIOB_AIMMR_P18 IO Line Index **/
#define PIOB_AIMMR_P18		(1 << 18)
/** PIOB_AIMMR_P17 IO Line Index **/
#define PIOB_AIMMR_P17		(1 << 17)
/** PIOB_AIMMR_P16 IO Line Index **/
#define PIOB_AIMMR_P16		(1 << 16)
/** PIOB_AIMMR_P15 IO Line Index **/
#define PIOB_AIMMR_P15		(1 << 15)
/** PIOB_AIMMR_P14 IO Line Index **/
#define PIOB_AIMMR_P14		(1 << 14)
/** PIOB_AIMMR_P13 IO Line Index **/
#define PIOB_AIMMR_P13		(1 << 13)
/** PIOB_AIMMR_P12 IO Line Index **/
#define PIOB_AIMMR_P12		(1 << 12)
/** PIOB_AIMMR_P11 IO Line Index **/
#define PIOB_AIMMR_P11		(1 << 11)
/** PIOB_AIMMR_P10 IO Line Index **/
#define PIOB_AIMMR_P10		(1 << 10)
/** PIOB_AIMMR_P9 IO Line Index **/
#define PIOB_AIMMR_P9		(1 << 9)
/** PIOB_AIMMR_P8 IO Line Index **/
#define PIOB_AIMMR_P8		(1 << 8)
/** PIOB_AIMMR_P7 IO Line Index **/
#define PIOB_AIMMR_P7		(1 << 7)
/** PIOB_AIMMR_P6 IO Line Index **/
#define PIOB_AIMMR_P6		(1 << 6)
/** PIOB_AIMMR_P5 IO Line Index **/
#define PIOB_AIMMR_P5		(1 << 5)
/** PIOB_AIMMR_P4 IO Line Index **/
#define PIOB_AIMMR_P4		(1 << 4)
/** PIOB_AIMMR_P3 IO Line Index **/
#define PIOB_AIMMR_P3		(1 << 3)
/** PIOB_AIMMR_P2 IO Line Index **/
#define PIOB_AIMMR_P2		(1 << 2)
/** PIOB_AIMMR_P1 IO Line Index **/
#define PIOB_AIMMR_P1		(1 << 1)
/** PIOB_AIMMR_P0 IO Line Index **/
#define PIOB_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_esr ESR Edge Select Register
@{*/

/** PIOB_ESR_P31 Edge Interrupt Selection **/
#define PIOB_ESR_P31		(1 << 31)
/** PIOB_ESR_P30 Edge Interrupt Selection **/
#define PIOB_ESR_P30		(1 << 30)
/** PIOB_ESR_P29 Edge Interrupt Selection **/
#define PIOB_ESR_P29		(1 << 29)
/** PIOB_ESR_P28 Edge Interrupt Selection **/
#define PIOB_ESR_P28		(1 << 28)
/** PIOB_ESR_P27 Edge Interrupt Selection **/
#define PIOB_ESR_P27		(1 << 27)
/** PIOB_ESR_P26 Edge Interrupt Selection **/
#define PIOB_ESR_P26		(1 << 26)
/** PIOB_ESR_P25 Edge Interrupt Selection **/
#define PIOB_ESR_P25		(1 << 25)
/** PIOB_ESR_P24 Edge Interrupt Selection **/
#define PIOB_ESR_P24		(1 << 24)
/** PIOB_ESR_P23 Edge Interrupt Selection **/
#define PIOB_ESR_P23		(1 << 23)
/** PIOB_ESR_P22 Edge Interrupt Selection **/
#define PIOB_ESR_P22		(1 << 22)
/** PIOB_ESR_P21 Edge Interrupt Selection **/
#define PIOB_ESR_P21		(1 << 21)
/** PIOB_ESR_P20 Edge Interrupt Selection **/
#define PIOB_ESR_P20		(1 << 20)
/** PIOB_ESR_P19 Edge Interrupt Selection **/
#define PIOB_ESR_P19		(1 << 19)
/** PIOB_ESR_P18 Edge Interrupt Selection **/
#define PIOB_ESR_P18		(1 << 18)
/** PIOB_ESR_P17 Edge Interrupt Selection **/
#define PIOB_ESR_P17		(1 << 17)
/** PIOB_ESR_P16 Edge Interrupt Selection **/
#define PIOB_ESR_P16		(1 << 16)
/** PIOB_ESR_P15 Edge Interrupt Selection **/
#define PIOB_ESR_P15		(1 << 15)
/** PIOB_ESR_P14 Edge Interrupt Selection **/
#define PIOB_ESR_P14		(1 << 14)
/** PIOB_ESR_P13 Edge Interrupt Selection **/
#define PIOB_ESR_P13		(1 << 13)
/** PIOB_ESR_P12 Edge Interrupt Selection **/
#define PIOB_ESR_P12		(1 << 12)
/** PIOB_ESR_P11 Edge Interrupt Selection **/
#define PIOB_ESR_P11		(1 << 11)
/** PIOB_ESR_P10 Edge Interrupt Selection **/
#define PIOB_ESR_P10		(1 << 10)
/** PIOB_ESR_P9 Edge Interrupt Selection **/
#define PIOB_ESR_P9		(1 << 9)
/** PIOB_ESR_P8 Edge Interrupt Selection **/
#define PIOB_ESR_P8		(1 << 8)
/** PIOB_ESR_P7 Edge Interrupt Selection **/
#define PIOB_ESR_P7		(1 << 7)
/** PIOB_ESR_P6 Edge Interrupt Selection **/
#define PIOB_ESR_P6		(1 << 6)
/** PIOB_ESR_P5 Edge Interrupt Selection **/
#define PIOB_ESR_P5		(1 << 5)
/** PIOB_ESR_P4 Edge Interrupt Selection **/
#define PIOB_ESR_P4		(1 << 4)
/** PIOB_ESR_P3 Edge Interrupt Selection **/
#define PIOB_ESR_P3		(1 << 3)
/** PIOB_ESR_P2 Edge Interrupt Selection **/
#define PIOB_ESR_P2		(1 << 2)
/** PIOB_ESR_P1 Edge Interrupt Selection **/
#define PIOB_ESR_P1		(1 << 1)
/** PIOB_ESR_P0 Edge Interrupt Selection **/
#define PIOB_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_lsr LSR Level Select Register
@{*/

