grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** PIOB_LSR_P31 Level Interrupt Selection **/
#define PIOB_LSR_P31		(1 << 31)
/** PIOB_LSR_P30 Level Interrupt Selection **/
#define PIOB_LSR_P30		(1 << 30)
/** PIOB_LSR_P29 Level Interrupt Selection **/
#define PIOB_LSR_P29		(1 << 29)
/** PIOB_LSR_P28 Level Interrupt Selection **/
#define PIOB_LSR_P28		(1 << 28)
/** PIOB_LSR_P27 Level Interrupt Selection **/
#define PIOB_LSR_P27		(1 << 27)
/** PIOB_LSR_P26 Level Interrupt Selection **/
#define PIOB_LSR_P26		(1 << 26)
/** PIOB_LSR_P25 Level Interrupt Selection **/
#define PIOB_LSR_P25		(1 << 25)
/** PIOB_LSR_P24 Level Interrupt Selection **/
#define PIOB_LSR_P24		(1 << 24)
/** PIOB_LSR_P23 Level Interrupt Selection **/
#define PIOB_LSR_P23		(1 << 23)
/** PIOB_LSR_P22 Level Interrupt Selection **/
#define PIOB_LSR_P22		(1 << 22)
/** PIOB_LSR_P21 Level Interrupt Selection **/
#define PIOB_LSR_P21		(1 << 21)
/** PIOB_LSR_P20 Level Interrupt Selection **/
#define PIOB_LSR_P20		(1 << 20)
/** PIOB_LSR_P19 Level Interrupt Selection **/
#define PIOB_LSR_P19		(1 << 19)
/** PIOB_LSR_P18 Level Interrupt Selection **/
#define PIOB_LSR_P18		(1 << 18)
/** PIOB_LSR_P17 Level Interrupt Selection **/
#define PIOB_LSR_P17		(1 << 17)
/** PIOB_LSR_P16 Level Interrupt Selection **/
#define PIOB_LSR_P16		(1 << 16)
/** PIOB_LSR_P15 Level Interrupt Selection **/
#define PIOB_LSR_P15		(1 << 15)
/** PIOB_LSR_P14 Level Interrupt Selection **/
#define PIOB_LSR_P14		(1 << 14)
/** PIOB_LSR_P13 Level Interrupt Selection **/
#define PIOB_LSR_P13		(1 << 13)
/** PIOB_LSR_P12 Level Interrupt Selection **/
#define PIOB_LSR_P12		(1 << 12)
/** PIOB_LSR_P11 Level Interrupt Selection **/
#define PIOB_LSR_P11		(1 << 11)
/** PIOB_LSR_P10 Level Interrupt Selection **/
#define PIOB_LSR_P10		(1 << 10)
/** PIOB_LSR_P9 Level Interrupt Selection **/
#define PIOB_LSR_P9		(1 << 9)
/** PIOB_LSR_P8 Level Interrupt Selection **/
#define PIOB_LSR_P8		(1 << 8)
/** PIOB_LSR_P7 Level Interrupt Selection **/
#define PIOB_LSR_P7		(1 << 7)
/** PIOB_LSR_P6 Level Interrupt Selection **/
#define PIOB_LSR_P6		(1 << 6)
/** PIOB_LSR_P5 Level Interrupt Selection **/
#define PIOB_LSR_P5		(1 << 5)
/** PIOB_LSR_P4 Level Interrupt Selection **/
#define PIOB_LSR_P4		(1 << 4)
/** PIOB_LSR_P3 Level Interrupt Selection **/
#define PIOB_LSR_P3		(1 << 3)
/** PIOB_LSR_P2 Level Interrupt Selection **/
#define PIOB_LSR_P2		(1 << 2)
/** PIOB_LSR_P1 Level Interrupt Selection **/
#define PIOB_LSR_P1		(1 << 1)
/** PIOB_LSR_P0 Level Interrupt Selection **/
#define PIOB_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_elsr ELSR Edge/Level Status Register
@{*/

/** PIOB_ELSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P31		(1 << 31)
/** PIOB_ELSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P30		(1 << 30)
/** PIOB_ELSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P29		(1 << 29)
/** PIOB_ELSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P28		(1 << 28)
/** PIOB_ELSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P27		(1 << 27)
/** PIOB_ELSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P26		(1 << 26)
/** PIOB_ELSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P25		(1 << 25)
/** PIOB_ELSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P24		(1 << 24)
/** PIOB_ELSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P23		(1 << 23)
/** PIOB_ELSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P22		(1 << 22)
/** PIOB_ELSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P21		(1 << 21)
/** PIOB_ELSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P20		(1 << 20)
/** PIOB_ELSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P19		(1 << 19)
/** PIOB_ELSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P18		(1 << 18)
/** PIOB_ELSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P17		(1 << 17)
/** PIOB_ELSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P16		(1 << 16)
/** PIOB_ELSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P15		(1 << 15)
/** PIOB_ELSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P14		(1 << 14)
/** PIOB_ELSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P13		(1 << 13)
/** PIOB_ELSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P12		(1 << 12)
/** PIOB_ELSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P11		(1 << 11)
/** PIOB_ELSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P10		(1 << 10)
/** PIOB_ELSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P9		(1 << 9)
/** PIOB_ELSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P8		(1 << 8)
/** PIOB_ELSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P7		(1 << 7)
/** PIOB_ELSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P6		(1 << 6)
/** PIOB_ELSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P5		(1 << 5)
/** PIOB_ELSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P4		(1 << 4)
/** PIOB_ELSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P3		(1 << 3)
/** PIOB_ELSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P2		(1 << 2)
/** PIOB_ELSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P1		(1 << 1)
/** PIOB_ELSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOB_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_fellsr FELLSR Falling Edge/Low-Level Select Register
@{*/

/** PIOB_FELLSR_P31 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P31		(1 << 31)
/** PIOB_FELLSR_P30 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P30		(1 << 30)
/** PIOB_FELLSR_P29 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P29		(1 << 29)
/** PIOB_FELLSR_P28 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P28		(1 << 28)
/** PIOB_FELLSR_P27 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P27		(1 << 27)
/** PIOB_FELLSR_P26 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P26		(1 << 26)
/** PIOB_FELLSR_P25 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P25		(1 << 25)
/** PIOB_FELLSR_P24 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P24		(1 << 24)
/** PIOB_FELLSR_P23 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P23		(1 << 23)
/** PIOB_FELLSR_P22 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P22		(1 << 22)
/** PIOB_FELLSR_P21 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P21		(1 << 21)
/** PIOB_FELLSR_P20 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P20		(1 << 20)
/** PIOB_FELLSR_P19 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P19		(1 << 19)
/** PIOB_FELLSR_P18 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P18		(1 << 18)
/** PIOB_FELLSR_P17 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P17		(1 << 17)
/** PIOB_FELLSR_P16 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P16		(1 << 16)
/** PIOB_FELLSR_P15 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P15		(1 << 15)
/** PIOB_FELLSR_P14 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P14		(1 << 14)
/** PIOB_FELLSR_P13 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P13		(1 << 13)
/** PIOB_FELLSR_P12 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P12		(1 << 12)
/** PIOB_FELLSR_P11 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P11		(1 << 11)
/** PIOB_FELLSR_P10 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P10		(1 << 10)
/** PIOB_FELLSR_P9 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P9		(1 << 9)
/** PIOB_FELLSR_P8 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P8		(1 << 8)
/** PIOB_FELLSR_P7 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P7		(1 << 7)
/** PIOB_FELLSR_P6 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P6		(1 << 6)
/** PIOB_FELLSR_P5 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P5		(1 << 5)
/** PIOB_FELLSR_P4 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P4		(1 << 4)
/** PIOB_FELLSR_P3 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P3		(1 << 3)
/** PIOB_FELLSR_P2 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P2		(1 << 2)
/** PIOB_FELLSR_P1 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P1		(1 << 1)
/** PIOB_FELLSR_P0 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_rehlsr REHLSR Rising Edge/High-Level Select Register
@{*/

/** PIOB_REHLSR_P31 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P31		(1 << 31)
/** PIOB_REHLSR_P30 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P30		(1 << 30)
/** PIOB_REHLSR_P29 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P29		(1 << 29)
/** PIOB_REHLSR_P28 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P28		(1 << 28)
/** PIOB_REHLSR_P27 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P27		(1 << 27)
/** PIOB_REHLSR_P26 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P26		(1 << 26)
/** PIOB_REHLSR_P25 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P25		(1 << 25)
/** PIOB_REHLSR_P24 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P24		(1 << 24)
/** PIOB_REHLSR_P23 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P23		(1 << 23)
/** PIOB_REHLSR_P22 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P22		(1 << 22)
/** PIOB_REHLSR_P21 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P21		(1 << 21)
/** PIOB_REHLSR_P20 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P20		(1 << 20)
/** PIOB_REHLSR_P19 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P19		(1 << 19)
/** PIOB_REHLSR_P18 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P18		(1 << 18)
/** PIOB_REHLSR_P17 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P17		(1 << 17)
/** PIOB_REHLSR_P16 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P16		(1 << 16)
/** PIOB_REHLSR_P15 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P15		(1 << 15)
/** PIOB_REHLSR_P14 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P14		(1 << 14)
/** PIOB_REHLSR_P13 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P13		(1 << 13)
/** PIOB_REHLSR_P12 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P12		(1 << 12)
/** PIOB_REHLSR_P11 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P11		(1 << 11)
/** PIOB_REHLSR_P10 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P10		(1 << 10)
/** PIOB_REHLSR_P9 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P9		(1 << 9)
/** PIOB_REHLSR_P8 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P8		(1 << 8)
/** PIOB_REHLSR_P7 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P7		(1 << 7)
/** PIOB_REHLSR_P6 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P6		(1 << 6)
/** PIOB_REHLSR_P5 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P5		(1 << 5)
/** PIOB_REHLSR_P4 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P4		(1 << 4)
/** PIOB_REHLSR_P3 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P3		(1 << 3)
/** PIOB_REHLSR_P2 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P2		(1 << 2)
/** PIOB_REHLSR_P1 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P1		(1 << 1)
/** PIOB_REHLSR_P0 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_frlhsr FRLHSR Fall/Rise - Low/High Status Register
@{*/

/** PIOB_FRLHSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P31		(1 << 31)
/** PIOB_FRLHSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P30		(1 << 30)
/** PIOB_FRLHSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P29		(1 << 29)
/** PIOB_FRLHSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P28		(1 << 28)
/** PIOB_FRLHSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P27		(1 << 27)
/** PIOB_FRLHSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P26		(1 << 26)
/** PIOB_FRLHSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P25		(1 << 25)
/** PIOB_FRLHSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P24		(1 << 24)
/** PIOB_FRLHSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P23		(1 << 23)
/** PIOB_FRLHSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P22		(1 << 22)
/** PIOB_FRLHSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P21		(1 << 21)
/** PIOB_FRLHSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P20		(1 << 20)
/** PIOB_FRLHSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P19		(1 << 19)
/** PIOB_FRLHSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P18		(1 << 18)
/** PIOB_FRLHSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P17		(1 << 17)
/** PIOB_FRLHSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P16		(1 << 16)
/** PIOB_FRLHSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P15		(1 << 15)
/** PIOB_FRLHSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P14		(1 << 14)
/** PIOB_FRLHSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P13		(1 << 13)
/** PIOB_FRLHSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P12		(1 << 12)
/** PIOB_FRLHSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P11		(1 << 11)
/** PIOB_FRLHSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P10		(1 << 10)
/** PIOB_FRLHSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P9		(1 << 9)
/** PIOB_FRLHSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P8		(1 << 8)
/** PIOB_FRLHSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P7		(1 << 7)
/** PIOB_FRLHSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P6		(1 << 6)
/** PIOB_FRLHSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P5		(1 << 5)
/** PIOB_FRLHSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P4		(1 << 4)
/** PIOB_FRLHSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P3		(1 << 3)
/** PIOB_FRLHSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P2		(1 << 2)
/** PIOB_FRLHSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P1		(1 << 1)
/** PIOB_FRLHSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOB_FRLHSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_locksr LOCKSR Lock Status
@{*/

