grevaillot/svd_tools/headers/ATSAM4SA16C/piob.h
/** PIOB_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOB_PCIER_RXBUFF		(1 << 3)
/** PIOB_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOB_PCIER_ENDRX		(1 << 2)
/** PIOB_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOB_PCIER_OVRE		(1 << 1)
/** PIOB_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOB_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pcidr PCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOB_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOB_PCIDR_RXBUFF		(1 << 3)
/** PIOB_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOB_PCIDR_ENDRX		(1 << 2)
/** PIOB_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOB_PCIDR_OVRE		(1 << 1)
/** PIOB_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOB_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pcimr PCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOB_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOB_PCIMR_RXBUFF		(1 << 3)
/** PIOB_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOB_PCIMR_ENDRX		(1 << 2)
/** PIOB_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOB_PCIMR_OVRE		(1 << 1)
/** PIOB_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOB_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pcisr PCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOB_PCISR_RXBUFF  **/
#define PIOB_PCISR_RXBUFF		(1 << 3)
/** PIOB_PCISR_ENDRX  **/
#define PIOB_PCISR_ENDRX		(1 << 2)
/** PIOB_PCISR_OVRE Parallel Capture Mode Overrun Error **/
#define PIOB_PCISR_OVRE		(1 << 1)
/** PIOB_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOB_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pcrhr PCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOB_PCRHR_RDATA_SHIFT		0
#define PIOB_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup piob_pcrhr_rdata RDATA Parallel Capture Mode Reception Data
@{*/
/**@}*/


/**@}*/
